export const blessings = {
  "2024-7": ["阿蕾奇诺", "托马", "克洛琳德", "久岐忍", "流浪者", "珐露珊"],
  "2024-8": ["芙宁娜", "芭芭拉", "神里绫华", "迪奥娜", "魈", "珐露珊"],
  "2024-9": ["迪希雅", "香菱", "玛拉妮", "坎蒂丝", "艾梅莉埃", "瑶瑶"],
  "2024-10": ["迪希雅", "夏沃蕾", "刻晴", "菲谢尔", "千织", "凝光"],
  "2024-11": ["可莉", "辛焱", "八重神子", "多莉", "提纳里", "绮良良"],
  "2024-12": ["珊瑚宫心海", "行秋", "雷电将军", "九条裟罗", "琴", "琳妮特"],
  "2025-1": ["迪卢克", "班尼特", "甘雨", "凯亚", "娜维娅", "诺艾尔"],
  "2025-2": ["胡桃", "嘉明", "莫娜", "行秋", "温迪", "鹿野院平藏"],
  "2025-3": ["芭芭拉", "神里绫人", "雷电将军", "欧洛伦", "优菈", "莱依拉"],
  "2025-4": ["宵宫", "托马", "克洛琳德", "北斗", "魈", "砂糖"],
  "2025-5": ["那维莱特", "坎蒂丝", "神里绫华", "夏洛蒂", "阿贝多", "卡齐娜"],
  "2025-6": ["赛诺", "菲谢尔", "七七", "米卡", "纳西妲", "柯莱"],
  "2025-7": ["林尼", "香菱", "达达利亚", "塔利雅", "莱欧斯利", "罗莎莉亚"],
  "2025-8": ["八重神子", "久岐忍", "甘雨", "莱依拉", "梦见月瑞希", "砂糖"],
  "2025-9": ["胡桃", "托马", "妮露", "行秋", "白术", "柯莱"],
  "2025-10": ["夜兰", "爱诺", "瓦雷莎", "伊安珊", "荒泷一斗", "五郎"]
}

export function CurrentImaginarium() {
  let time = new Date()
  let year = time.getFullYear()
  let month = time.getMonth() + 1
  let timeData = `${year}-${month}`
  return blessings[timeData] || []
}