export const ArtifactBuffs = {
  // cons4
   // 海啸级

  "无妄者": {
    check: ({ characterName }) => characterName === '漂泊者·湮灭',
    title: '声骸技能：[无妄者] 施放共鸣解放·临渊死寂后，声骸技能造成的伤害提升[rDmg]%',
    data: {
      rDmg: 50
    }
  },
  "角": {
    title: '声骸技能：[角] 施放声骸技能时，自身的共鸣技能伤害加成提升[eDmg]%',
    data: {
      eDmg: 16
    }
  },
  "赫卡忒": {
    title: '声骸技能：[赫卡忒] 在首位装配该声骸技能时，自身协同攻击造成的伤害提升[xDmg]%',
    data: {
      xDmg: 40
    }
  },
  "共鸣回响·芙露德莉斯": {
    title: '声骸技能：[共鸣回响·芙露德莉斯] 在首位装配该声骸技能时，伤害加成提升[dmg]%',
    data: {
      dmg: ({ characterName, element }) => element === '气动' ? (['漂泊者·气动', '卡提希娅'].includes(characterName) ? 20 : 10) : 0
    }
  },
  "鸣钟之龟": {
    check: ({ params }) => !params.TruceTime,
    title: '声骸技能：[鸣钟之龟] 为队伍中登场角色提供的[_reduction]%减伤和[dmg]%的伤害提升',
    data: {
      _reduction: 50,
      dmg: 10
    }
  },

   //怒涛级

  "朔雷之鳞": {},
  "无冠者": {},
  "飞廉之猩": {},
  "辉萤军势": {},
  "哀声鸷": {},
  "聚械机偶": {},
  "无常凶鹭": {},
  "无归的谬误": {},
  "罗蕾莱": {},
  "异构武装": {},
  "叹息古龙": {},
  "荣耀狮像": {},
  "云闪之鳞": {},
  "燎照之骑": {},
  "梦魇·飞廉之猩": {
    title: '声骸技能：[梦魇·飞廉之猩] 首位装配时，伤害加成提升[dmg]%，重击伤害加成提升[a2Dmg]%',
    data: {
      dmg: ({ element }) => element === '气动' ? 12 : 0,
      a2Dmg: 12
    }
  },
  "梦魇·无常凶鹭": {
    title: '声骸技能：[梦魇·无常凶鹭] 首位装配时，伤害加成提升[dmg]%，重击伤害加成提升[a2Dmg]%',
    data: {
      dmg: ({ element }) => element === '湮灭' ? 12 : 0,
      a2Dmg: 12
    }
  },
  "梦魇·云闪之鳞": {
    title: '声骸技能：[梦魇·云闪之鳞] 首位装配时，伤害加成提升[dmg]%，共鸣解放伤害加成提升[qDmg]%',
    data: {
      dmg: ({ element }) => element === '导电' ? 12 : 0,
      qDmg: 12
    }
  },
  "梦魇·朔雷之鳞": {
    title: '声骸技能：[梦魇·朔雷之鳞] 首位装配时，伤害加成提升[dmg]%，共鸣技能伤害加成提升[eDmg]%',
    data: {
      dmg: ({ element }) => element === '导电' ? 12 : 0,
      eDmg: 12
    }
  },
  "梦魇·无冠者": {
    title: '声骸技能：[梦魇·无冠者] 首位装配时，伤害加成提升[dmg]%，普攻伤害加成提升[aDmg]%',
    data: {
      dmg: ({ element }) => element === '湮灭' ? 12 : 0,
      aDmg: 12
    }
  },
  "梦魇·燎照之骑": {
    title: '声骸技能：[梦魇·燎照之骑] 首位装配时，伤害加成提升[dmg]%，共鸣技能伤害加成提升[eDmg]%',
    data: {
      dmg: ({ element }) => element === '热熔' ? 12 : 0,
      eDmg: 12
    }
  },
  "梦魇·哀声鸷": {
    title: '声骸技能：[梦魇·哀声鸷] 首位装配时，伤害加成提升[dmg]%',
    data: {
      dmg: ({ element }) => element === '衍射' ? 12 : 0
    }
  },
  "梦魇·辉萤军势": {
    title: '声骸技能：[梦魇·辉萤军势] 首位装配时，伤害加成提升[dmg]%，协同攻击造成的伤害提升[xDmg]%',
    data: {
      dmg: ({ element }) => element === '冷凝' ? 12 : 0,
      xDmg: 30
    }
  },
  "梦魇·凯尔匹": {
    title: '声骸技能：[梦魇·凯尔匹] 首位装配时，伤害加成提升[dmg]%',
    data: {
      dmg: ({ element }) => ['冷凝', '气动'].includes(element) ? 12 : 0
    }
  },

  // cons3
   //巨浪级
  "戏猿": {},
  "车刃镰": {},
  "巡哨机傀": {},
  "雪鬃狼": {},
  "游鳞机枢": {},
  "踏光兽": {},
  "巡游骑士": {},
  "幻昼骑士": {},
  "暗夜骑士": {},
  "毒冠贵族": {},
  "持刃贵族": {},
  "凝水贵族": {},
  "浮灵偶": {},
  "琉璃刀伶": {},
  "巨布偶": {},
  "重塑雕像的拳砾": {},
  "飓力熊": {},
  "荣光节使": {},
  "传道者的遗形": {},
  "角鳄": {},
  "紫羽鹭": {},
  "青羽鹭": {},
  "坚岩斗士": {},
  "奏谕乐师": {},
  "振铎乐师": {},
  "磐石守卫": {},
  "冥渊守卫": {},
  "绿熔蜥": {},
  "刺玫菇": {},
  "暗鬃狼": {},
  "箭簇熊": {},

  // cons1
   //轻波级

  "幼猿": {},
  "晶螯蝎": {},
  "啾啾河豚": {},
  "通行灯偶": {},
  "叮咚咚": {},
  "融火虫": {},
  "侏侏鸵": {},
  "风鬃狼": {},
  "雷鬃狼": {},
  "霜鬃狼": {},
  "浮灵偶·海德": {},
  "浮灵偶·蕾弗": {},
  "浮灵偶·莱特": {},
  "幽翎火": {},
  "云海妖精": {},
  "魔术先生": {},
  "寂寞小姐": {},
  "工头布偶": {},
  "欺诈奇藏": {},
  "愚金幼岩": {},
  "釉变幼岩": {},
  "气动棱镜": {},
  "卫冕节使": {},
  "赦罪节使": {},
  "慈悲节使": {},
  "小翼龙·气动": {},
  "小翼龙·导电": {},
  "小翼龙·冷凝": {},
  "小翼龙·热熔": {},
  "小翼龙·衍射": {},
  "小翼龙·湮灭": {},
  "苦信者的作俑": {},
  "先锋幼岩": {},
  "裂变幼岩": {},
  "惊蛰猎手": {},
  "鸣泣战士": {},
  "审判战士": {},
  "咔嚓嚓": {},
  "阿嗞嗞": {},
  "呼咻咻": {},
  "呜咔咔": {},
  "破霜猎手": {},
  "巡徊猎手": {},
  "游弋蝶": {},
  "碎獠猪": {},
  "咕咕河豚": {},
  "遁地鼠": {},
  "绿熔蜥（稚形）": {},
  "刺玫菇（稚形）": {},
  "火鬃狼": {},
  "寒霜陆龟": {},
  "热熔棱镜": {},
  "冷凝棱镜": {},
  "衍射棱镜": {},
  "湮灭棱镜": {}

}