export const ArtifactDmg = {
  // cons4
  // 海啸级

  "无妄者": {
    title: '无妄者声骸伤害',
    params: { EchoUse: 4, EchoHit: 6, EchoDmg: 6, DreamlessDreamless: true },
    dmg: ({ EchoStar, element }, dmg) => {
      let r1 = dmg([33.8, 38.87, 43.94, 49.01, 54.08][EchoStar - 1], 'r')
      let r2 = dmg([169, 194.35, 219.70, 245.05, 270.4][EchoStar - 1], 'r')
      let r3 = dmg([33.8, 38.87, 43.94, 49.01, 54.08][EchoStar - 1], 'r', 'scene')
      let r4 = dmg([169, 194.35, 219.70, 245.05, 270.4][EchoStar - 1], 'r', 'scene')
      return {
        dmg: element === '湮灭' ? (r1.dmg * 5 + r2.dmg) : (r3.dmg * 5 + r4.dmg),
        avg: element === '湮灭' ? (r1.avg * 5 + r2.avg) : (r3.avg * 5 + r4.avg)
      }
    }
  },
  "角": {
    title: '角声骸伤害',
    params: { EchoUse: 1, EchoHit: 8, EchoDmg: 8 },
    dmg: ({ EchoStar, element }, dmg) => {
      let r1 = dmg([30.4, 34.96, 39.52, 44.08, 48.64][EchoStar - 1], 'r')
      let r2 = dmg([12.12, 13.98, 15.81, 17.63, 19.46][EchoStar - 1], 'r')
      let r3 = dmg([30.4, 34.96, 39.52, 44.08, 48.64][EchoStar - 1], 'r')
      let r4 = dmg([30.4, 34.96, 39.52, 44.08, 48.64][EchoStar - 1], 'r', 'scene')
      let r5 = dmg([12.12, 13.98, 15.81, 17.63, 19.46][EchoStar - 1], 'r', 'scene')
      let r6 = dmg([30.4, 34.96, 39.52, 44.08, 48.64][EchoStar - 1], 'r', 'scene')
      return {
        dmg: element === '衍射' ? (r1.dmg + r2.dmg * 5 + r3.dmg * 2) : (r4.dmg + r5.dmg * 5 + r6.dmg * 2),
        avg: element === '衍射' ? (r1.avg + r2.avg * 5 + r3.avg * 2) : (r4.avg + r5.avg * 5 + r6.avg * 2)
      }
    }
  },
  "赫卡忒": {
    title: '赫卡忒声骸单段',
    params: { EchoUse: 1, EchoHit: 3, EchoDmg: 3 },
    dmg: ({ EchoStar, element }, dmg) => {
      let r1 = dmg([25.37, 30.4, 35.46, 40.53, 45.59][EchoStar - 1], 'r')
      let r2 = dmg([25.37, 30.4, 35.46, 40.53, 45.59][EchoStar - 1], 'r', 'scene')
      return {
        dmg: element === '湮灭' ? r1.dmg : r2.dmg,
        avg: element === '湮灭' ? r1.avg : r2.avg
      }
    }
  },
  "共鸣回响·芙露德莉斯": {
    title: '共鸣回响·芙露德莉斯声骸伤害',
    params: { EchoUse: 1, EchoHit: 9, EchoDmg: 9 },
    dmg: ({ EchoStar, element }, dmg) => {
      let r1 = dmg([15.2, 18.24, 21.28, 24.32, 27.36][EchoStar - 1], 'r')
      let r2 = dmg([76, 91.2, 106.4, 121.6, 136.8][EchoStar - 1], 'r')
      let r3 = dmg([15.2, 18.24, 21.28, 24.32, 27.36][EchoStar - 1], 'r', 'scene')
      let r4 = dmg([76, 91.2, 106.4, 121.6, 136.8][EchoStar - 1], 'r', 'scene')
      return {
        dmg: element === '气动' ? (r1.dmg * 8 + r2.dmg) : (r3.dmg * 8 + r4.dmg),
        avg: element === '气动' ? (r1.avg * 8 + r2.avg) : (r3.avg * 8 + r4.avg)
      }
    }
  },
  "鸣钟之龟": {
    title: '鸣钟之龟声骸伤害',
    params: { EchoUse: 1, EchoHit: 1, EchoDmg: 1 },
    dmg: ({ EchoStar, element }, dmg) => {
      let r1 = dmg([91.2, 104.88, 118.56, 132.24, 145.92][EchoStar - 1], 'r')
      let r2 = dmg([91.2, 104.88, 118.56, 132.24, 145.92][EchoStar - 1], 'r', 'scene')
      return {
        dmg: element === '冷凝' ? r1.dmg : r2.dmg,
        avg: element === '冷凝' ? r1.avg : r2.avg
      }
    }
  },
  "梦魇·赫卡忒": {
    title: '梦魇·赫卡忒声骸伤害',
    params: { EchoUse: 1, EchoHit: 2, EchoDmg: 2 },
    dmg: ({ EchoStar, element }, dmg) => {
      let r1 = dmg([124.50, 149.40, 174.30, 199.20, 224.10][EchoStar - 1], 'r')
      let r2 = dmg([124.50, 149.40, 174.30, 199.20, 224.10][EchoStar - 1], 'r', 'scene')
      return {
        dmg: (element === '湮灭' ? r1.dmg : r2.dmg) * 2,
        avg: (element === '湮灭' ? r1.avg : r2.avg) * 2
      }
    }
  },

  //怒涛级

  "朔雷之鳞": {},
  "无冠者": {},
  "飞廉之猩": {},
  "辉萤军势": {},
  "哀声鸷": {},
  "聚械机偶": {},
  "无常凶鹭": {},
  "无归的谬误": {},
  "罗蕾莱": {},
  "异构武装": {},
  "叹息古龙": {},
  "荣耀狮像": {},
  "云闪之鳞": {},
  "燎照之骑": {},
  "梦魇·飞廉之猩": {},
  "梦魇·无常凶鹭": {},
  "梦魇·云闪之鳞": {},
  "梦魇·朔雷之鳞": {},
  "梦魇·无冠者": {},
  "梦魇·燎照之骑": {},
  "梦魇·哀声鸷": {},
  "梦魇·辉萤军势": {},
  "梦魇·凯尔匹": {},
  "共鸣回响·芬莱克": {},

  // cons3
  //巨浪级
  "戏猿": {},
  "车刃镰": {},
  "巡哨机傀": {},
  "雪鬃狼": {},
  "游鳞机枢": {},
  "踏光兽": {},
  "巡游骑士": {},
  "幻昼骑士": {},
  "暗夜骑士": {},
  "毒冠贵族": {},
  "持刃贵族": {},
  "凝水贵族": {},
  "浮灵偶": {},
  "琉璃刀伶": {},
  "巨布偶": {},
  "重塑雕像的拳砾": {},
  "飓力熊": {},
  "荣光节使": {},
  "传道者的遗形": {},
  "角鳄": {},
  "紫羽鹭": {},
  "青羽鹭": {},
  "坚岩斗士": {},
  "奏谕乐师": {},
  "振铎乐师": {},
  "磐石守卫": {},
  "冥渊守卫": {},
  "绿熔蜥": {},
  "刺玫菇": {},
  "暗鬃狼": {},
  "箭簇熊": {},
  "梦魇·振铎乐师": {},

  // cons1
  //轻波级

  "幼猿": {},
  "晶螯蝎": {},
  "啾啾河豚": {},
  "通行灯偶": {},
  "叮咚咚": {},
  "融火虫": {},
  "侏侏鸵": {},
  "风鬃狼": {},
  "雷鬃狼": {},
  "霜鬃狼": {},
  "浮灵偶·海德": {},
  "浮灵偶·蕾弗": {},
  "浮灵偶·莱特": {},
  "幽翎火": {},
  "云海妖精": {},
  "魔术先生": {},
  "寂寞小姐": {},
  "工头布偶": {},
  "欺诈奇藏": {},
  "愚金幼岩": {},
  "釉变幼岩": {},
  "气动棱镜": {},
  "卫冕节使": {},
  "赦罪节使": {},
  "慈悲节使": {},
  "小翼龙·气动": {},
  "小翼龙·导电": {},
  "小翼龙·冷凝": {},
  "小翼龙·热熔": {},
  "小翼龙·衍射": {},
  "小翼龙·湮灭": {},
  "苦信者的作俑": {},
  "先锋幼岩": {},
  "裂变幼岩": {},
  "惊蛰猎手": {},
  "鸣泣战士": {},
  "审判战士": {},
  "咔嚓嚓": {},
  "阿嗞嗞": {},
  "呼咻咻": {},
  "呜咔咔": {},
  "破霜猎手": {},
  "巡徊猎手": {},
  "游弋蝶": {},
  "碎獠猪": {},
  "咕咕河豚": {},
  "遁地鼠": {},
  "绿熔蜥（稚形）": {},
  "刺玫菇（稚形）": {},
  "火鬃狼": {},
  "寒霜陆龟": {},
  "热熔棱镜": {},
  "冷凝棱镜": {},
  "衍射棱镜": {},
  "湮灭棱镜": {},
  "梦魇·审判战士": {},
  "梦魇·破霜猎手": {}

}