// New in '2.8'

export const GlacioCharacter = [ //冷凝属性角色（ 漏了记得帮忙补上 :( ）
  '散华', '白芷', '釉瑚',
  '凌阳', '折枝', '珂莱塔', '漂泊者·冷凝'
]
export const FusionCharacter = [ //热熔属性角色（ 漏了记得帮忙补上 :( ）
  '炽霞', '莫特斐',
  '安可', '长离', '布兰特', '露帕', '嘉贝莉娜', '漂泊者·热熔'
]
export const AeroCharacter = [ //气动属性角色（ 漏了记得帮忙补上 :( ）
  '秧秧', '秋水',
  '鉴心', '忌炎', '夏空', '卡提希娅', '尤诺', '仇远', '漂泊者·气动'
]
export const ElectroCharacter = [ //导电属性角色（ 漏了记得帮忙补上 :( ）
  '渊武', '灯灯', '卜灵',
  '卡卡罗', '吟霖', '相里要', '奥古斯塔', '漂泊者·导电'
]
export const SpectrpCharacter = [ //衍射属性角色（ 漏了记得帮忙补上 :( ）
  '维里奈', '今汐', '守岸人', '菲比', '赞妮', '漂泊者·衍射'
]
export const HavocCharacter = [ //湮灭属性角色（ 漏了记得帮忙补上 :( ）
  '桃祈', '丹瑾',
  '椿', '洛可可', '坎特蕾拉', '弗洛洛', '漂泊者·湮灭', '千咲'
]
export const HealCharacter = [ //治疗角色（ 漏了记得帮忙补上 :( ）
  '白芷', '釉瑚', '丹瑾',
  '鉴心', '漂泊者·气动', '卡提希娅', '维里奈', '守岸人', '坎特蕾拉', '千咲'
]
export const TeamHealCharacter = [ //队伍治疗角色（ 漏了记得帮忙补上 :( ）
  '白芷', '釉瑚',
  '鉴心', '漂泊者·气动', '维里奈', '守岸人', '坎特蕾拉', '千咲'
]
export const ShieldCharacter = [ //护盾角色（ 漏了记得帮忙补上 :( ）
  '桃祈',
  '奥古斯塔', '鉴心', '尤诺', '千咲'
]

export const CharacterParams = {  //特殊配置，角色单独设置请在此配置

}
