
let replace_list = {
	'换生命': '换100000005妮露',
	'换防御': '换100000005云堇',
	'换攻击': '换100000005申鹤',
	'换充能': '换100000005温迪',
	'换元素充能': '换100000005温迪',
	'换元素充能效率': '换100000005温迪',
	'换精通': '换100000005砂糖',
	'换元素精通': '换100000005砂糖',
	'换治疗': '换100000005七七',
	'换加成治疗': '换100000005七七',
	'换暴击': '换100000005八重',
	'换暴击率': '换100000005八重',
	'换爆击': '换100000005八重',
	'换爆击率': '换100000005八重',
	'换暴伤': '换100000005刻晴',
	'换暴击伤害': '换100000005刻晴',
	'换爆伤': '换100000005刻晴',
	'换爆击伤害': '换100000005刻晴',
	'换物伤': '换100000005雷泽',
	'换物理伤害': '换100000005雷泽',
	'换物理伤害加成': '换100000005雷泽',
	'换火伤': '换100000005可莉',
	'换火元素伤害': '换100000005可莉',
	'换火元素伤害加成': '换100000005可莉',
	'换水伤': '换100000005达达利亚',
	'换水元素伤害': '换100000005达达利亚',
	'换水元素伤害加成': '换100000005达达利亚',
	'换雷伤': '换100000005北斗',
	'换雷元素伤害': '换100000005北斗',
	'换雷元素伤害加成': '换100000005北斗',
	'换冰伤': '换100000005埃洛伊',
	'换冰元素伤害': '换100000005埃洛伊',
	'换冰元素伤害加成': '换100000005埃洛伊',
	'换草伤': '换100000005提纳里',
	'换草元素伤害': '换100000005提纳里',
	'换草元素伤害加成': '换100000005提纳里',
	'换风伤': '换100000005平藏',
	'换风元素伤害': '换100000005平藏',
	'换风元素伤害加成': '换100000005平藏',
	'换岩伤': '换100000005钟离',
	'换岩元素伤害': '换100000005钟离',
	'换岩元素伤害加成': '换100000005钟离',
	'极限面板': '面板100000000',
	'极限伤害': '伤害100000000',
	'核爆面板': '面板100000001',
	'核爆伤害': '伤害100000001',
	'辅助面板': '面板100000002',
	'辅助伤害': '伤害100000002',
	'平民面板': '面板100000003',
	'平民伤害': '伤害100000003',
	'毕业面板': '面板100000004',
	'伤害面板': '伤害100000004',
};

export class xiaofei_input_replace extends plugin {
	constructor () {
		super({
			/** 功能名称 */
			name: '输入替换',
			/** 功能描述 */
			dsc: '',
			/** https://oicqjs.github.io/oicq/#events */
			event: 'message',
			/** 优先级，数字越小等级越高 */
			priority: -10
		});
	}
	
	accept(e){
		for(let key in replace_list){
			try{
				let reg = RegExp(key);
				if(!reg.test(e.msg)) continue;
				e.msg = e.msg.replace(reg,replace_list[key]);
			}catch(err){}
		}
	}
}