// New in '菈乌玛'

export const AnemoCharacter = [ //风属性角色（ 漏了记得帮忙补上 :( ）
  '伊法', '蓝砚', '琳妮特', '珐露珊', '鹿野院平藏', '早柚', '砂糖',
  '梦见月瑞希', '恰斯卡', '闲云', '流浪者', '枫原万叶', '魈', '温迪', '琴', '旅行者/anemo'
]
export const GeoCharacter = [ //岩属性角色（ 漏了记得帮忙补上 :( ）
  '卡齐娜', '云堇', '五郎', '诺艾尔', '凝光',
  '希诺宁', '千织', '娜维娅', '荒泷一斗', '阿贝多', '钟离', '旅行者/geo'
]
export const ElectroCharacter = [ //雷属性角色（ 漏了记得帮忙补上 :( ）
  '伊安珊', '欧洛伦', '赛索斯', '多莉', '久岐忍', '九条裟罗', '菲谢尔', '北斗', '雷泽', '丽莎',
  '伊涅芙', '瓦雷莎', '克洛琳德', '赛诺', '八重神子', '雷电将军', '刻晴', '旅行者/electro'
]
export const DendroCharacter = [ //草属性角色（ 漏了记得帮忙补上 :( ）
  '绮良良', '卡维', '瑶瑶', '柯莱',
  '菈乌玛', '基尼奇', '艾梅莉埃', '白术', '艾尔海森', '纳西妲', '提纳里', '旅行者/dendro'
]
export const HydroCharacter = [ //水属性角色（ 漏了记得帮忙补上 :( ）
  '塔利雅', '坎蒂丝', '行秋', '芭芭拉',
  '玛拉妮', '希格雯', '芙宁娜', '那维莱特', '妮露', '夜兰', '神里绫人', '珊瑚宫心海', '达达利亚', '莫娜', '旅行者/hydro'
]
export const PyroCharacter = [ //火属性角色（ 漏了记得帮忙补上 :( ）
  '嘉明', '夏沃蕾', '托马', '烟绯', '辛焱', '班尼特', '香菱', '安柏',
  '玛微卡', '阿蕾奇诺', '林尼', '迪希雅', '宵宫', '胡桃', '可莉', '迪卢克', '旅行者/pyro'
]
export const CryoCharacter = [ //冰属性角色（ 漏了记得帮忙补上 :( ）
  '夏洛蒂', '菲米尼', '米卡', '莱依拉', '罗莎莉亚', '迪奥娜', '重云', '凯亚',
  '丝柯克', '爱可菲', '茜特菈莉', '莱欧斯利', '申鹤', '埃洛伊', '神里绫华', '优菈', '甘雨', '七七', '旅行者/cryo'
]
export const LiyueCharacter = [ //璃月角色（ 漏了记得帮忙补上 :( ）
  '行秋', '香菱', '重云', '北斗', '凝光', '辛焱', '烟绯', '云堇', '瑶瑶', '嘉明', '蓝砚',
  '七七', '刻晴', '钟离', '甘雨', '魈', '胡桃', '申鹤', '夜兰', '白术', '闲云'
]
export const FontaineCharacter = [ //枫丹角色（ 漏了记得帮忙补上 :( ）
  '琳尼特', '菲米尼', '夏洛蒂', '夏沃蕾',
  '林尼', '那维莱特', '莱欧斯利', '芙宁娜', '娜维娅', '克洛琳德', '希格雯', '艾梅莉埃', '爱可菲'
]
export const NatlanCharacter = [ //纳塔角色（ 漏了记得帮忙补上 :( ）
  '伊法', '伊安珊', '欧洛伦', '卡齐娜',
  '玛拉妮', '基尼奇', '希诺宁', '恰斯卡', '茜特菈莉', '瓦雷莎'
]
export const HealCharacter = [ //治疗角色（ 漏了记得帮忙补上 :( ）
  '行秋', '芭芭拉', '班尼特', '凯亚', '诺艾尔', '迪奥娜', '早柚', '久岐忍', '多莉', '瑶瑶', '米卡', '卡维', '伊法', '琳妮特', '夏洛蒂', '夏沃蕾', '嘉明',
  '琴', '七七', '旅行者/anemo', '胡桃', '珊瑚宫心海', '迪希雅', '白术', '林尼', '旅行者/hydro', '那维莱特', '莱欧斯利', '芙宁娜', '闲云', '阿蕾奇诺', '克洛林德', '希格雯', '希诺宁', '梦见月瑞希'
]
export const TeamHealCharacter = [ //队伍治疗角色（ 漏了记得帮忙补上 :( ）
  '行秋', '芭芭拉', '班尼特', '诺艾尔', '迪奥娜', '伊法', '早柚', '久岐忍', '多莉', '瑶瑶', '米卡', '夏洛蒂', '夏沃蕾',
  '琴', '七七', '珊瑚宫心海', '白术', '芙宁娜', '闲云', '希格雯', '希诺宁', '梦见月瑞希'
]
export const ShieldCharacter = [ //护盾角色（ 漏了记得帮忙补上 :( ）
  '托马', '辛焱', '塔利雅', '北斗', '莱依拉', '迪奥娜', '绮良良', '蓝砚', '云堇', '诺艾尔',
  '伊涅芙', '茜特菈莉', '白术', '钟离'
]
export const TruceHpCharacter = [ //后台变动生命值角色
  '伊法', '夏洛蒂', '米卡', '瑶瑶', '芭芭拉', '诺艾尔', '早柚',
  '希格雯', '珊瑚宫心海', '七七', '白术', '琴', '芙宁娜', '闲云', '迪希雅'
]
export const CharacterParams = {  //特殊配置，角色单独设置请在此配置
  "阿贝多": { CrystallizeNumber: 3 },
  "班尼特": { OwnHp: 50 },
  "胡桃": { OwnHp: 30 },
  "荒泷一斗": { CrystallizeNumber: 3 },
  "久岐忍": { OwnHp: 25 },
  "卡齐娜": { CrystallizeNumber: 5 },
  "莱欧斯利": { OwnHp: 50 },
  "雷泽": { TargetHp: 25 },
  "娜维娅": { CrystallizeNumber: 5 },
  "凝光": { CrystallizeNumber: 5 },
  "诺艾尔": { CrystallizeNumber: 5 },
  "千织": { CrystallizeNumber: 2 },
  "神里绫人": { TargetHp: 25 },
  "瓦雷莎": { PlungingUse: 2, PlungingHit: 2, PlungingDmg: 2 },
  "五郎": { CrystallizeNumber: 3 },
  "希诺宁": { CrystallizeNumber: 5 },
  "魈": { OwnHp: 41.19 },
  "烟绯": { TargetHp: 25 },
  "优菈": { TargetHp: 25 },
  "云堇": { CrystallizeNumber: 2 },
  "钟离": { CrystallizeNumber: 5 },
  "重云": { TargetHp: 80 },
  "旅行者/geo": { CrystallizeNumber: 3 }
}
