export const CharacterAlias = {
  灵可: '零可',
  残虹: '残红',
  伊洛伊: '161,一六一,一罗伊,伊罗伊,天线羊,佐巴羊',
  真红: '龙骑士,龙骑,火龙果,火龙果小姐',
  卡厄斯: '嘉豪,佳豪',
  安魂曲: '小煤球,胖蝙蝠,小蝙蝠,番茄酱恶魔',
  浔: '老板娘,浔老板,寻老板,巡老板,寻,巡,逊,荨,训,旬',
  娜娜莉: '红毛耄耋,牢大,那那利,那那莉,娜娜利,安琪拉',
  小吱: '吱本家,资本家',
  哈索尔: '鬼火少女,外卖员,机车女',
  九原: '',
  法帝娅: '',
  早雾: '',
  白藏: '向日葵,向日葵队长',
  达芙蒂尔: '特务,女特务,芙蒂尔,蒂尔,大帝',
  海月: '水母,水母姐',
  薄荷: '基米',
  阿德勒: '管家',
  翳: '狗哥,狗狗人',
  哈尼娅: '孤独摇滚',
  埃德嘉: '埃德加'
}

export const WeaponAlias = {
  "错误的门": '错误门,错误',
  "穿过胭红蜃景": '穿过胭红，胭红,蜃景,胭红蜃景',
  "众人追寻之物": '众人,追寻,追寻之物',
  "「最后一朵玫瑰」": '最后一朵玫瑰,最后玫瑰,一朵玫瑰,最后一朵',
  "行进于时间之外": '行进时间之外,时间之外,时间之外',
  "预备备": '预备',

  "「倾世之雨」": '倾世之雨,倾世雨,倾世',
  "休息日": '休息',
  "海特洛的安宁": '安宁,海特洛安宁',
  "千金难买你开心": '千金,千金难买',
  "现实避难所": '避难所',
  "无畏之绵": '无畏绵',
  "引爆全场": '引爆',
  "极速之绵": '极速绵',
  "漆黑青春妄想": '漆黑青春妄想,妄想',
  "焰魂狂飙": '焰魂,狂飙',
  "鲸之歌": '鲸歌',
  "「银河暂留」": '银河暂留,银河暂留',
  "不屈之绵": '不屈绵',
  "灵敏之绵": '灵敏绵',
  "面具下的泪": '面具泪,面具',
  "好狗狗走四方": '狗狗,走四方,四方',
  "思考喵": '思考,喵',
  "凶猛之绵": '凶猛绵',
  "茶花会": '',
  "永恒圆舞曲": '永恒,圆舞曲',

  "勿忘伞": '',
  "拔刀": '',
  "被遗忘者": '遗忘者',
  "该死的邂逅": '邂逅',
  "挂你在心口难开": '心口难开,难开',
  "愚者种春": '愚者,种春',
  "开始净空": '净空',
  "欧拉欧拉！": '欧拉欧拉,欧拉',
  "灵感大逃杀": '大逃杀',
  "终有时": '',
  "当心头顶": '',
  "闪耀的每一天": '闪耀每一天,每一天',
  "时间大盗": '',
  "扭曲之城的呼唤": '扭曲之城',
  "光波眩晕，迷走狂欢": '',
  "良药苦口": '',

  "笑口常开": '',
  "「我们。」": '我们。,我们',
  "成功的第一步": '成功,第一步',
  "危险游戏": '',
  "「电音」狂欢": '电音狂欢,电音,狂欢'

}

export const EchoAlias = {
  "「迪亚波罗斯」": '迪亚波罗斯,迪亚,波罗斯',
  "「恶魔之血：诅咒」": '恶魔之血,诅咒,血源诅咒',
  "「街头拳王」": '街头拳王,拳王',
  "「静谧山庄」": '静谧山庄,静谧,山庄',
  "「森林萤火之心」": '森林萤火之心,萤火',
  "「失落光芒」": '失落光芒,失落,光芒',
  "「守卫王国」": '守卫王国,守卫,王国',
  "「缇娅的夜间酒馆」": '缇娅的夜间酒馆,缇娅,酒馆',
  "「小小大冒险」": '小小大冒险,大冒险,冒险',
  "「音速蓝刺猬」": '音速蓝刺猬,音速,蓝刺猬,刺猬',
  "「影之信条」": '影之信条,信条',
  "「真红：双生蝶」": '真红：双生蝶,双生蝶'
}

export const MonsterAlias = {

}

export const ItemAlias = {

}

export const alias = CharacterAlias