export const poolName = {
  娜娜莉: '王牌一代目',
  预备备: '猛虎特刊',
  浔: '独酌胧月流',
  行进于时间之外: '名月特刊',
  安魂曲: '久梦初醒时',
  "「最后一朵玫瑰」": '夜曲特刊',
  卡厄斯: '无归路',
  众人追寻之物: '追猎特刊',
  真红: '破晓前',
  穿过胭红蜃景: '决意特刊',
  伊洛伊: '生命线',
  错误的门: '启门特刊'
}

export const Poolpermanent = [{
  version: '1.0',
  half: '常驻',
  versionName: '',
  char5: ['早雾', '法帝娅', '白藏', '哈索尔', '达芙蒂尔', '九原'],
  char4: [],
  item5: []
}]

export const versionName = {
  "1.0": "公测",
  "1.1": "游梦洄廊",
  "1.2": "九百九十九夜"
}


export const poolDetail = [{
  version: '1.0',
  half: '上半',
  from: '2026-04-23 10:00:00',
  to: '2026-05-07 05:59:59',
  char5: ['娜娜莉'],
  char4: ['埃德嘉', '薄荷', '阿德勒'],
  weapon5: ['预备备'],
  weapon4: ['被遗忘者', '开始净空', '当心头顶', '勿忘伞', '拔刀'],
  item5: ['华丽飞踢', '萌虎来袭', '副手的副手']
}, {
  version: '1.0',
  half: '下半',
  from: '2026-05-07 06:00:00',
  to: '2026-05-28 05:59:59',
  char5: ['浔'],
  char4: ['哈尼娅', '海月', '翳'],
  weapon5: ['行进于时间之外'],
  weapon4: ['被遗忘者', '开始净空', '当心头顶', '勿忘伞', '拔刀'],
  item5: ['幽兰', '秋色残影', '兰花不菲']
}, {
  version: '1.1',
  half: '上半',
  from: '2026-05-28 06:00:00',
  to: '2026-06-18 05:59:59',
  char5: ['安魂曲'],
  char4: ['埃德嘉', '薄荷', '阿德勒'],
  weapon5: ['「最后一朵玫瑰」'],
  weapon4: ['被遗忘者', '开始净空', '当心头顶', '勿忘伞', '拔刀'],
  item5: ['好柿成双', '番茄酱巡航', '鎏金交响诗']
}, {
  version: '1.1',
  half: '下半',
  from: '2026-06-18 06:00:00',
  to: '2026-07-02 05:59:59',
  char5: ['卡厄斯'],
  char4: ['哈尼娅', '海月', '翳'],
  weapon5: ['众人追寻之物'],
  weapon4: ['被遗忘者', '开始净空', '当心头顶', '勿忘伞', '拔刀'],
  item5: ['天际猎手', '猎犬奔袭', '放晴日']
}, {
  version: '1.2',
  half: '上半',
  from: '2026-07-02 06:00:00',
  to: '2026-07-23 05:59:59',
  char5: ['真红'],
  char4: ['埃德嘉', '薄荷', '阿德勒'],
  weapon5: ['穿过胭红蜃景'],
  weapon4: ['被遗忘者', '开始净空', '当心头顶', '勿忘伞', '拔刀'],
  item5: ['蔽日之影', '赤炎龙影', '地海高校生']
}, {
  version: '1.2',
  half: '下半',
  from: '2026-07-23 06:00:00',
  to: '2026-08-13 05:59:59',
  char5: ['伊洛伊'],
  char4: ['哈尼娅', '海月', '翳'],
  weapon5: ['错误的门'],
  weapon4: ['被遗忘者', '开始净空', '当心头顶', '勿忘伞', '拔刀'],
  item5: ['小羊直升机', '我们仨', '大魔导师']
}]

export const mixPoolDetail = []
